modules/budget/transactions/ui/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":budget:data" [fillcolor="#160185"]
  ":budget:model" [fillcolor="#160185"]
  ":budget:transactions:ui" [fillcolor="#6b6b01"]
  ":budget:transactions:vm" [fillcolor="#914141"]
  ":core:di" [fillcolor="#a17103"]
  ":core:model" [fillcolor="#160185"]
  ":core:ui" [fillcolor="#6b6b01"]
  ":l10n" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":prefs" [fillcolor="#160185"]
  ":budget:data" -> ":budget:model" [style="bold"]
  ":budget:data" -> ":core:model" [style="bold"]
  ":budget:data" -> ":logging" [style="dashed"]
  ":budget:transactions:ui" -> ":budget:model" [style="bold"]
  ":budget:transactions:ui" -> ":budget:transactions:vm" [style="bold"]
  ":budget:transactions:ui" -> ":core:model" [style="dashed"]
  ":budget:transactions:ui" -> ":core:ui" [style="bold"]
  ":budget:transactions:ui" -> ":l10n" [style="dashed"]
  ":budget:transactions:vm" -> ":budget:data" [style="bold"]
  ":budget:transactions:vm" -> ":budget:model" [style="bold"]
  ":budget:transactions:vm" -> ":core:di" [style="bold"]
  ":budget:transactions:vm" -> ":core:di" [style="dashed"]
  ":budget:transactions:vm" -> ":core:model" [style="dashed"]
  ":budget:transactions:vm" -> ":logging" [style="dashed"]
  ":budget:transactions:vm" -> ":prefs" [style="dashed"]
  ":core:di" -> ":budget:data" [style="bold"]
  ":core:di" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":core:di" [style="dashed"]
  ":core:ui" -> ":core:model" [style="bold"]
  ":core:ui" -> ":l10n" [style="dashed"]
  ":prefs" -> ":core:model" [style="bold"]
}
